The part type of the pipe fitting or pipe accessory.
  Namespace:   Autodesk.Revit.DB.Plumbing
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2014
 Syntax
  C#
public PartType PartType { get; }
  Visual Basic
Public ReadOnly Property PartType As PartType
	Get
  Visual C++
public:
property PartType PartType {
	PartType get ();
}
 See Also
  PipeFittingAndAccessoryData Class
  Autodesk.Revit.DB.Plumbing Namespace